#include <stdio.h>
#include <stdlib.h>

int main()
//{
  // int n;
  // scanf("%d",&n);
  // int fact =1;
  // int i=1;
  // while(i<=n)
        // {
        //        fact*=i;
  // i++;

        // }
     //   for (i=1;//初始条件能不能进去先进行语句 然后在for语句上的变换也要进行判断，先进行第一步再次进入时完成一轮，求和为0求积为1定义可以写在里面

    //    i<=n;i++)//循环继续的条件，循环每一轮要做的事情
     //   {
       //     fact *=i;
    //    }
      //   printf("%d!=%d\n",n,fact);
   // return 0;
//}f后可以没有else
//循环选择 for用叠加循环次数是n从0到n再循环结束时是一样的
//也可以改为for循环两者等价流程图相同两者可以互相改写
//for的每一个表达式都是可以省略的但是分号不能省
//三种循环有哪个先判断
//如果有固定次数用for
//如果必须执行一次用do_while
//其他情况用while
//bool类型之后可以<stdbool.h>
//逻辑运算，结果只有01，表达区间，
//条件运算符 count=（count》20）？count-10:count+10 if else 优先级比赋值高，比其他所有的都低
//逗号运算，用来连接两个表达式并以右边的表达式来运算
//嵌套的if else 大括号
//素数 循环的控制 利用for（有递增）判断取余是否为零则不是一个素数，整个循环走完了是素数但是没有走完
//再来的变量表达x是素数如果能做出判断就是else不是素数需要证伪通过一轮的循环得到了，一直到 最后的时候
//当其能够整除的时候就能离开循环break 也是另一个语句 一旦遇到break可以让我们掏出循环countinue 能够跳过循环再回到循环头
//循环的嵌套，内外循环的控制变量不同
//前五十个素数for循环不合适了 我们要用计数器只要他小于50将for改造成了while 也可以用for但是条件不同
